tutorials/multiphase/interCondensingEvaporatingFoam/condensatingVessel/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1606+                                |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phases (liquid vapour);// FC-72


sigma           sigma [1 0 -2 0 0 0 0] 0.07;

liquid
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 2.64e-7;
    rho             rho [1 -3 0 0 0 0 0] 1583.4;


    Cp              Cp [0 2 -2 -1 0 0 0] 1.1072e3;
    Cv              cv [0 2 -2 -1 0 0 0] 1.1072e3; //assume Cp for liquid
    kappa           kappa [1 1 -3 -1 0 0 0] 0.057;
    hf              hf [0 2 -2 0 0 0 0] 0;
}

vapour
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0]  5e-7;
    rho             rho [1 -3 0 0 0 0 0] 14.9;


    Cp              Cp [0 2 -2 -1 0 0 0] 895.2; //FC72 vapour
    Cv              Cv [0 2 -2 -1 0 0 0] 870.4; // Cv = Cp - R/w
    kappa           kappa [1 1 -3 -1 0 0 0] 0.01; //FC72 vapour
    hf              hf [0 2 -2 0 0 0 0] 93.0e3;
}

Prt     0.7;

// ************************************************************************* //
